zephyrproject-rtos/hal_stm32/stm32cube/stm32wbaxx/soc/stm32wba23xx.h
/*******************  Bit definition for AES_IER register     ******************/
#define AES_IER_CCFIE_Pos                   (0UL)
#define AES_IER_CCFIE_Msk                   (0x1UL << AES_IER_CCFIE_Pos)            /*!< 0x00000001 */
#define AES_IER_CCFIE                       AES_IER_CCFIE_Msk                       /*!< Computation complete flag interrupt enable */
#define AES_IER_RWEIE_Pos                   (1UL)
#define AES_IER_RWEIE_Msk                   (0x1UL << AES_IER_RWEIE_Pos)            /*!< 0x00000002 */
#define AES_IER_RWEIE                       AES_IER_RWEIE_Msk                       /*!< Read or write error Interrupt Enable */
#define AES_IER_KEIE_Pos                    (2UL)
#define AES_IER_KEIE_Msk                    (0x1UL << AES_IER_KEIE_Pos)             /*!< 0x00000004 */
#define AES_IER_KEIE                        AES_IER_KEIE_Msk                        /*!< Key error interrupt enable */

/*******************  Bit definition for AES_ISR register     ******************/
#define AES_ISR_CCF_Pos                     (0UL)
#define AES_ISR_CCF_Msk                     (0x1UL << AES_ISR_CCF_Pos)              /*!< 0x00000001 */
#define AES_ISR_CCF                         AES_ISR_CCF_Msk                         /*!< Computation complete flag */
#define AES_ISR_RWEIF_Pos                   (1UL)
#define AES_ISR_RWEIF_Msk                   (0x1UL << AES_ISR_RWEIF_Pos)            /*!< 0x00000002 */
#define AES_ISR_RWEIF                       AES_ISR_RWEIF_Msk                       /*!< Read or write error Interrupt flag */
#define AES_ISR_KEIF_Pos                    (2UL)
#define AES_ISR_KEIF_Msk                    (0x1UL << AES_ISR_KEIF_Pos)             /*!< 0x00000004 */
#define AES_ISR_KEIF                        AES_ISR_KEIF_Msk                        /*!< Key error interrupt flag */

/*******************  Bit definition for AES_ICR register     ******************/
#define AES_ICR_CCF_Pos                     (0UL)
#define AES_ICR_CCF_Msk                     (0x1UL << AES_ICR_CCF_Pos)              /*!< 0x00000001 */
#define AES_ICR_CCF                         AES_ICR_CCF_Msk                         /*!< Computation complete flag clear */
#define AES_ICR_RWEIF_Pos                   (1UL)
#define AES_ICR_RWEIF_Msk                   (0x1UL << AES_ICR_RWEIF_Pos)            /*!< 0x00000002 */
#define AES_ICR_RWEIF                       AES_ICR_RWEIF_Msk                       /*!< Read or write error Interrupt flag clear */
#define AES_ICR_KEIF_Pos                    (2UL)
#define AES_ICR_KEIF_Msk                    (0x1UL << AES_ICR_KEIF_Pos)             /*!< 0x00000004 */
#define AES_ICR_KEIF                        AES_ICR_KEIF_Msk                        /*!< Key error interrupt flag clear */

/******************************************************************************/
/*                                                                            */
/*                                 Debug MCU                                  */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for DBGMCU_IDCODE register  *************/
#define DBGMCU_IDCODE_DEV_ID_Pos            (0UL)
#define DBGMCU_IDCODE_DEV_ID_Msk            (0xFFFUL << DBGMCU_IDCODE_DEV_ID_Pos)   /*!< 0x00000FFF */
#define DBGMCU_IDCODE_DEV_ID                DBGMCU_IDCODE_DEV_ID_Msk
#define DBGMCU_IDCODE_REV_ID_Pos            (16UL)
#define DBGMCU_IDCODE_REV_ID_Msk            (0xFFFFUL << DBGMCU_IDCODE_REV_ID_Pos)  /*!< 0xFFFF0000 */
#define DBGMCU_IDCODE_REV_ID                DBGMCU_IDCODE_REV_ID_Msk

/********************  Bit definition for DBGMCU_SCR register  *****************/
#define DBGMCU_SCR_DBG_SLEEP_Pos            (0UL)
#define DBGMCU_SCR_DBG_SLEEP_Msk            (0x1UL << DBGMCU_SCR_DBG_SLEEP_Pos)   /*!< 0x00000001 */
#define DBGMCU_SCR_DBG_SLEEP                DBGMCU_SCR_DBG_SLEEP_Msk              /*!< DBG_SLEEP (Allows SRAM access in Sleep mode) */
#define DBGMCU_SCR_DBG_STOP_Pos             (1UL)
#define DBGMCU_SCR_DBG_STOP_Msk             (0x1UL << DBGMCU_SCR_DBG_STOP_Pos)      /*!< 0x00000002 */
#define DBGMCU_SCR_DBG_STOP                 DBGMCU_SCR_DBG_STOP_Msk
#define DBGMCU_SCR_DBG_STANDBY_Pos          (2UL)
#define DBGMCU_SCR_DBG_STANDBY_Msk          (0x1UL << DBGMCU_SCR_DBG_STANDBY_Pos)   /*!< 0x00000004 */
#define DBGMCU_SCR_DBG_STANDBY              DBGMCU_SCR_DBG_STANDBY_Msk
#define DBGMCU_SCR_DBG_LPMS_Pos             (16UL)
#define DBGMCU_SCR_DBG_LPMS_Msk             (0x7UL << DBGMCU_SCR_DBG_LPMS_Pos)      /*!< 0x00070000 */
#define DBGMCU_SCR_DBG_LPMS                 DBGMCU_SCR_DBG_LPMS_Msk
#define DBGMCU_SCR_DBG_LPMS_0               (0x1UL << DBGMCU_SCR_DBG_LPMS_Pos)
#define DBGMCU_SCR_DBG_LPMS_1               (0x2UL << DBGMCU_SCR_DBG_LPMS_Pos)
#define DBGMCU_SCR_DBG_LPMS_2               (0x4UL << DBGMCU_SCR_DBG_LPMS_Pos)
#define DBGMCU_SCR_DBG_STOPF_Pos            (19UL)
#define DBGMCU_SCR_DBG_STOPF_Msk            (0x1UL << DBGMCU_SCR_DBG_STOPF_Pos)     /*!< 0x00080000 */
#define DBGMCU_SCR_DBG_STOPF                DBGMCU_SCR_DBG_STOPF_Msk
#define DBGMCU_SCR_DBG_SBF_Pos              (20UL)
#define DBGMCU_SCR_DBG_SBF_Msk              (0x1UL << DBGMCU_SCR_DBG_SBF_Pos)       /*!< 0x00100000 */
#define DBGMCU_SCR_DBG_SBF                  DBGMCU_SCR_DBG_SBF_Msk
#define DBGMCU_SCR_DBG_CS_Pos               (24UL)
#define DBGMCU_SCR_DBG_CS_Msk               (0x1UL << DBGMCU_SCR_DBG_CS_Pos)        /*!< 0x01000000 */
#define DBGMCU_SCR_DBG_CS                   DBGMCU_SCR_DBG_CS_Msk
#define DBGMCU_SCR_DBG_CDS_Pos              (25UL)
#define DBGMCU_SCR_DBG_CDS_Msk              (0x1UL << DBGMCU_SCR_DBG_CDS_Pos)       /*!< 0x02000000 */
#define DBGMCU_SCR_DBG_CDS                  DBGMCU_SCR_DBG_CDS_Msk

/********************  Bit definition for DBGMCU_APB1LFZR register  ***********/
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP_Pos   (0UL)
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP_Msk   (0x1UL << DBGMCU_APB1LFZR_DBG_TIM2_STOP_Pos)
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP       DBGMCU_APB1LFZR_DBG_TIM2_STOP_Msk
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP_Pos   (12UL)
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP_Msk   (0x1UL << DBGMCU_APB1LFZR_DBG_IWDG_STOP_Pos)
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP       DBGMCU_APB1LFZR_DBG_IWDG_STOP_Msk
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP_Pos   (21UL)
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP_Msk   (0x1UL << DBGMCU_APB1LFZR_DBG_I2C1_STOP_Pos)
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP       DBGMCU_APB1LFZR_DBG_I2C1_STOP_Msk

/********************  Bit definition for DBGMCU_APB1HFZR register  ***********/
#define DBGMCU_APB1HFZR_DBG_LPTIM2_STOP_Pos (5UL)
#define DBGMCU_APB1HFZR_DBG_LPTIM2_STOP_Msk (0x1UL << DBGMCU_APB1HFZR_DBG_LPTIM2_STOP_Pos)
#define DBGMCU_APB1HFZR_DBG_LPTIM2_STOP     DBGMCU_APB1HFZR_DBG_LPTIM2_STOP_Msk

/********************  Bit definition for DBGMCU_APB2FZR register  ***********/
#define DBGMCU_APB2FZR_DBG_TIM16_STOP_Pos   (17UL)
#define DBGMCU_APB2FZR_DBG_TIM16_STOP_Msk   (0x1UL << DBGMCU_APB2FZR_DBG_TIM16_STOP_Pos)
#define DBGMCU_APB2FZR_DBG_TIM16_STOP       DBGMCU_APB2FZR_DBG_TIM16_STOP_Msk
#define DBGMCU_APB2FZR_DBG_TIM17_STOP_Pos   (18UL)
#define DBGMCU_APB2FZR_DBG_TIM17_STOP_Msk   (0x1UL << DBGMCU_APB2FZR_DBG_TIM17_STOP_Pos)
#define DBGMCU_APB2FZR_DBG_TIM17_STOP       DBGMCU_APB2FZR_DBG_TIM17_STOP_Msk

/********************  Bit definition for DBGMCU_APB7FZR register  ***********/
#define DBGMCU_APB7FZR_DBG_I2C3_STOP_Pos    (10UL)
#define DBGMCU_APB7FZR_DBG_I2C3_STOP_Msk    (0x1UL << DBGMCU_APB7FZR_DBG_I2C3_STOP_Pos)
#define DBGMCU_APB7FZR_DBG_I2C3_STOP        DBGMCU_APB7FZR_DBG_I2C3_STOP_Msk
#define DBGMCU_APB7FZR_DBG_LPTIM1_STOP_Pos  (17UL)
#define DBGMCU_APB7FZR_DBG_LPTIM1_STOP_Msk  (0x1UL << DBGMCU_APB7FZR_DBG_LPTIM1_STOP_Pos)
#define DBGMCU_APB7FZR_DBG_LPTIM1_STOP      DBGMCU_APB7FZR_DBG_LPTIM1_STOP_Msk
#define DBGMCU_APB7FZR_DBG_RTC_STOP_Pos     (30UL)
#define DBGMCU_APB7FZR_DBG_RTC_STOP_Msk     (0x1UL << DBGMCU_APB7FZR_DBG_RTC_STOP_Pos)
#define DBGMCU_APB7FZR_DBG_RTC_STOP         DBGMCU_APB7FZR_DBG_RTC_STOP_Msk

/********************  Bit definition for DBGMCU_AHB1FZR register  ***********/
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH0_STOP_Pos (0UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH0_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH0_STOP_Pos) /*!< 0x00000001 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH0_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH0_STOP_Msk            /*!< DBG_LPDMA1_CH0_STOP (LPDMA 1 channel 0 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH1_STOP_Pos (1UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH1_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH1_STOP_Pos) /*!< 0x00000002 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH1_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH1_STOP_Msk            /*!< DBG_LPDMA1_CH1_STOP (LPDMA 1 channel 1 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH2_STOP_Pos (2UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH2_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH2_STOP_Pos) /*!< 0x00000004 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH2_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH2_STOP_Msk            /*!< DBG_LPDMA1_CH2_STOP (LPDMA 1 channel 2 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH3_STOP_Pos (3UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH3_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH3_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH3_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH3_STOP_Msk            /*!< DBG_LPDMA1_CH3_STOP (LPDMA 1 channel 3 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH4_STOP_Pos (4UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH4_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH4_STOP_Pos) /*!< 0x00000010 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH4_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH4_STOP_Msk            /*!< DBG_LPDMA1_CH4_STOP (LPDMA 1 channel 4 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH5_STOP_Pos (5UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH5_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH5_STOP_Pos) /*!< 0x00000020 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH5_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH5_STOP_Msk            /*!< DBG_LPDMA1_CH5_STOP (LPDMA 1 channel 5 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH6_STOP_Pos (6UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH6_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH6_STOP_Pos) /*!< 0x00000040 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH6_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH6_STOP_Msk            /*!< DBG_LPDMA1_CH6_STOP (LPDMA 1 channel 6 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH7_STOP_Pos (7UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH7_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH7_STOP_Pos) /*!< 0x00000080 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH7_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH7_STOP_Msk            /*!< DBG_LPDMA1_CH7_STOP (LPDMA 1 channel 7 stop in CPU debug) */

