zephyrproject-rtos/hal_stm32/stm32cube/stm32wbaxx/soc/stm32wba23xx.h
/******************  Bit definition for SYSCFG_CCVR register  ****************/
#define SYSCFG_CCVR_NCV1_Pos                (0UL)
#define SYSCFG_CCVR_NCV1_Msk                (0xFUL << SYSCFG_CCVR_NCV1_Pos)         /*!< 0x0000000F */
#define SYSCFG_CCVR_NCV1                    SYSCFG_CCVR_NCV1_Msk                    /*!< NMOS compensation value for VDD Power Rail */
#define SYSCFG_CCVR_PCV1_Pos                (4UL)
#define SYSCFG_CCVR_PCV1_Msk                (0xFUL << SYSCFG_CCVR_PCV1_Pos)         /*!< 0x000000F0 */
#define SYSCFG_CCVR_PCV1                    SYSCFG_CCVR_PCV1_Msk                    /*!< PMOS compensation value for VDD Power Rail */

/******************  Bit definition for SYSCFG_CCCR register  ****************/
#define SYSCFG_CCCR_NCC1_Pos                (0UL)
#define SYSCFG_CCCR_NCC1_Msk                (0xFUL << SYSCFG_CCCR_NCC1_Pos)         /*!< 0x0000000F */
#define SYSCFG_CCCR_NCC1                    SYSCFG_CCCR_NCC1_Msk                    /*!< NMOS compensation code for VDD Power Rail */
#define SYSCFG_CCCR_PCC1_Pos                (4UL)
#define SYSCFG_CCCR_PCC1_Msk                (0xFUL << SYSCFG_CCCR_PCC1_Pos)         /*!< 0x000000F0 */
#define SYSCFG_CCCR_PCC1                    SYSCFG_CCCR_PCC1_Msk                    /*!< PMOS compensation code for VDD Power Rail */

/******************  Bit definition for SYSCFG_RSSCMD register  ***************/
#define SYSCFG_RSSCMD_RSSCMD_Pos            (0UL)
#define SYSCFG_RSSCMD_RSSCMD_Msk            (0xFFFFUL << SYSCFG_RSSCMD_RSSCMD_Pos)  /*!< 0x0000FFFF */
#define SYSCFG_RSSCMD_RSSCMD                SYSCFG_RSSCMD_RSSCMD_Msk                /*!< RSS command */

/*****************  Bit definition for SYSCFG_FAIER register  *****************/
#define SYSCFG_FAIER_PVD_Pos                (0UL)
#define SYSCFG_FAIER_PVD_Msk                (0x1U << SYSCFG_FAIER_PVD_Pos)          /*!< 0x00000001 */
#define SYSCFG_FAIER_PVD                    SYSCFG_FAIER_PVD_Msk                    /*!< enable EXTI16 PVD interrupt to abort Flash operation */
#define SYSCFG_FAIER_EXTI2_Pos              (1UL)
#define SYSCFG_FAIER_EXTI2_Msk              (0x1U << SYSCFG_FAIER_EXTI2_Pos)        /*!< 0x00000002 */
#define SYSCFG_FAIER_EXTI2                  SYSCFG_FAIER_EXTI2_Msk                  /*!< enable EXTI2 interrupt to abort Flash operation */
#define SYSCFG_FAIER_EXTI3_Pos              (2UL)
#define SYSCFG_FAIER_EXTI3_Msk              (0x1U << SYSCFG_FAIER_EXTI3_Pos)        /*!< 0x00000004 */
#define SYSCFG_FAIER_EXTI3                  SYSCFG_FAIER_EXTI3_Msk                  /*!< enable EXTI3 interrupt to abort Flash operation */
#define SYSCFG_FAIER_EXTI4_Pos              (3UL)
#define SYSCFG_FAIER_EXTI4_Msk              (0x1U << SYSCFG_FAIER_EXTI4_Pos)        /*!< 0x00000008 */
#define SYSCFG_FAIER_EXTI4                  SYSCFG_FAIER_EXTI4_Msk                  /*!< enable EXTI4 interrupt to abort Flash operation */
#define SYSCFG_FAIER_EXTI5_Pos              (4UL)
#define SYSCFG_FAIER_EXTI5_Msk              (0x1U << SYSCFG_FAIER_EXTI5_Pos)        /*!< 0x00000010 */
#define SYSCFG_FAIER_EXTI5                  SYSCFG_FAIER_EXTI5_Msk                  /*!< enable EXTI5 interrupt to abort Flash operation */
#define SYSCFG_FAIER_LPDMA_CH0_Pos          (5UL)
#define SYSCFG_FAIER_LPDMA_CH0_Msk          (0x1U << SYSCFG_FAIER_LPDMA_CH0_Pos)    /*!< 0x00000020 */
#define SYSCFG_FAIER_LPDMA_CH0              SYSCFG_FAIER_LPDMA_CH0_Msk              /*!< enable LPDMA_CH0 interrupt to abort Flash operation */
#define SYSCFG_FAIER_LPDMA_CH1_Pos          (6UL)
#define SYSCFG_FAIER_LPDMA_CH1_Msk          (0x1U << SYSCFG_FAIER_LPDMA_CH1_Pos)    /*!< 0x00000040 */
#define SYSCFG_FAIER_LPDMA_CH1              SYSCFG_FAIER_LPDMA_CH1_Msk              /*!< enable LPDMA_CH1 interrupt to abort Flash operation */
#define SYSCFG_FAIER_LPDMA_CH2_Pos          (7UL)
#define SYSCFG_FAIER_LPDMA_CH2_Msk          (0x1U << SYSCFG_FAIER_LPDMA_CH2_Pos)    /*!< 0x00000080 */
#define SYSCFG_FAIER_LPDMA_CH2              SYSCFG_FAIER_LPDMA_CH2_Msk              /*!< enable LPDMA_CH2 interrupt to abort Flash operation */
#define SYSCFG_FAIER_LPDMA_CH3_Pos          (8UL)
#define SYSCFG_FAIER_LPDMA_CH3_Msk          (0x1U << SYSCFG_FAIER_LPDMA_CH3_Pos)    /*!< 0x00000100 */
#define SYSCFG_FAIER_LPDMA_CH3              SYSCFG_FAIER_LPDMA_CH3_Msk              /*!< enable LPDMA_CH3 interrupt to abort Flash operation */
#define SYSCFG_FAIER_I2C1_EV_Pos            (9UL)
#define SYSCFG_FAIER_I2C1_EV_Msk            (0x1U << SYSCFG_FAIER_I2C1_EV_Pos)      /*!< 0x00000200 */
#define SYSCFG_FAIER_I2C1_EV                SYSCFG_FAIER_I2C1_EV_Msk                /*!< enable I2C1_EV interrupt to abort Flash operation */
#define SYSCFG_FAIER_USART1_Pos             (11UL)
#define SYSCFG_FAIER_USART1_Msk             (0x1U << SYSCFG_FAIER_USART1_Pos)       /*!< 0x00000800 */
#define SYSCFG_FAIER_USART1                 SYSCFG_FAIER_USART1_Msk                 /*!< enable USART1 interrupt to abort Flash operation */
#define SYSCFG_FAIER_LPUART1_Pos            (13UL)
#define SYSCFG_FAIER_LPUART1_Msk            (0x1U << SYSCFG_FAIER_LPUART1_Pos)      /*!< 0x00002000 */
#define SYSCFG_FAIER_LPUART1                SYSCFG_FAIER_LPUART1_Msk                /*!< enable LPUART1 interrupt to abort Flash operation */
#define SYSCFG_FAIER_I2C3_EV_Pos            (14UL)
#define SYSCFG_FAIER_I2C3_EV_Msk            (0x1U << SYSCFG_FAIER_I2C3_EV_Pos)      /*!< 0x00004000 */
#define SYSCFG_FAIER_I2C3_EV                SYSCFG_FAIER_I2C3_EV_Msk                /*!< enable I2C3_EV interrupt to abort Flash operation */
#define SYSCFG_FAIER_SAI1_Pos               (15UL)
#define SYSCFG_FAIER_SAI1_Msk               (0x1U << SYSCFG_FAIER_SAI1_Pos)         /*!< 0x00008000 */
#define SYSCFG_FAIER_SAI1                   SYSCFG_FAIER_SAI1_Msk                   /*!< enable SAI1 interrupt to abort Flash operation */
#define SYSCFG_FAIER_SPI3_Pos               (16UL)
#define SYSCFG_FAIER_SPI3_Msk               (0x1U << SYSCFG_FAIER_SPI3_Pos)         /*!< 0x00010000 */
#define SYSCFG_FAIER_SPI3                   SYSCFG_FAIER_SPI3_Msk                   /*!< enable SPI3 interrupt to abort Flash operation */
#define SYSCFG_FAIER_RADIO_Pos              (18UL)
#define SYSCFG_FAIER_RADIO_Msk              (0x1U << SYSCFG_FAIER_RADIO_Pos)        /*!< 0x00040000 */
#define SYSCFG_FAIER_RADIO                  SYSCFG_FAIER_RADIO_Msk                  /*!< enable RADIO interrupt to abort Flash operation */
#define SYSCFG_FAIER_WKUP_Pos               (19UL)
#define SYSCFG_FAIER_WKUP_Msk               (0x1U << SYSCFG_FAIER_WKUP_Pos)         /*!< 0x00080000 */
#define SYSCFG_FAIER_WKUP                   SYSCFG_FAIER_WKUP_Msk                   /*!< enable PWR WKUP interrupt to abort Flash operation */
#define SYSCFG_FAIER_WKUP_S_Pos             (20UL)
#define SYSCFG_FAIER_WKUP_S_Msk             (0x1U << SYSCFG_FAIER_WKUP_S_Pos)       /*!< 0x00100000 */
#define SYSCFG_FAIER_WKUP_S                 SYSCFG_FAIER_WKUP_S_Msk                 /*!< enable PWR WKUP secure interrupt to abort Flash operation */


/******************************************************************************/
/*                                                                            */
/*                     Tamper and backup register (TAMP)                      */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for TAMP_CR1 register  *****************/
#define TAMP_CR1_TAMP1E_Pos                 (0UL)
#define TAMP_CR1_TAMP1E_Msk                 (0x1UL << TAMP_CR1_TAMP1E_Pos)          /*!< 0x00000001 */
#define TAMP_CR1_TAMP1E                     TAMP_CR1_TAMP1E_Msk
#define TAMP_CR1_TAMP2E_Pos                 (1UL)
#define TAMP_CR1_TAMP2E_Msk                 (0x1UL << TAMP_CR1_TAMP2E_Pos)          /*!< 0x00000002 */
#define TAMP_CR1_TAMP2E                     TAMP_CR1_TAMP2E_Msk
#define TAMP_CR1_TAMP3E_Pos                 (2UL)
#define TAMP_CR1_TAMP3E_Msk                 (0x1UL << TAMP_CR1_TAMP3E_Pos)          /*!< 0x00000004 */
#define TAMP_CR1_TAMP3E                     TAMP_CR1_TAMP3E_Msk
#define TAMP_CR1_TAMP4E_Pos                 (3UL)
#define TAMP_CR1_TAMP4E_Msk                 (0x1UL << TAMP_CR1_TAMP4E_Pos)          /*!< 0x00000008 */
#define TAMP_CR1_TAMP4E                     TAMP_CR1_TAMP4E_Msk
#define TAMP_CR1_ITAMP3E_Pos                (18UL)
#define TAMP_CR1_ITAMP3E_Msk                (0x1UL << TAMP_CR1_ITAMP3E_Pos)         /*!< 0x00040000 */
#define TAMP_CR1_ITAMP3E                    TAMP_CR1_ITAMP3E_Msk
#define TAMP_CR1_ITAMP5E_Pos                (20UL)
#define TAMP_CR1_ITAMP5E_Msk                (0x1UL << TAMP_CR1_ITAMP5E_Pos)         /*!< 0x00100000 */
#define TAMP_CR1_ITAMP5E                    TAMP_CR1_ITAMP5E_Msk
#define TAMP_CR1_ITAMP6E_Pos                (21UL)
#define TAMP_CR1_ITAMP6E_Msk                (0x1UL << TAMP_CR1_ITAMP6E_Pos)         /*!< 0x00200000 */
#define TAMP_CR1_ITAMP6E                    TAMP_CR1_ITAMP6E_Msk
#define TAMP_CR1_ITAMP7E_Pos                (22UL)
#define TAMP_CR1_ITAMP7E_Msk                (0x1UL << TAMP_CR1_ITAMP7E_Pos)         /*!< 0x00400000 */
#define TAMP_CR1_ITAMP7E                    TAMP_CR1_ITAMP7E_Msk
#define TAMP_CR1_ITAMP8E_Pos                (23UL)
#define TAMP_CR1_ITAMP8E_Msk                (0x1UL << TAMP_CR1_ITAMP8E_Pos)         /*!< 0x00800000 */
#define TAMP_CR1_ITAMP8E                    TAMP_CR1_ITAMP8E_Msk
#define TAMP_CR1_ITAMP9E_Pos                (24UL)
#define TAMP_CR1_ITAMP9E_Msk                (0x1UL << TAMP_CR1_ITAMP9E_Pos)         /*!< 0x01000000 */
#define TAMP_CR1_ITAMP9E                    TAMP_CR1_ITAMP9E_Msk
#define TAMP_CR1_ITAMP11E_Pos               (26UL)
#define TAMP_CR1_ITAMP11E_Msk               (0x1UL << TAMP_CR1_ITAMP11E_Pos)        /*!< 0x04000000 */
#define TAMP_CR1_ITAMP11E                   TAMP_CR1_ITAMP11E_Msk
#define TAMP_CR1_ITAMP12E_Pos               (27UL)
#define TAMP_CR1_ITAMP12E_Msk               (0x1UL << TAMP_CR1_ITAMP12E_Pos)        /*!< 0x08000000 */
#define TAMP_CR1_ITAMP12E                   TAMP_CR1_ITAMP12E_Msk
#define TAMP_CR1_ITAMP13E_Pos               (28UL)
#define TAMP_CR1_ITAMP13E_Msk               (0x1UL << TAMP_CR1_ITAMP13E_Pos)        /*!< 0x10000000 */
#define TAMP_CR1_ITAMP13E                   TAMP_CR1_ITAMP13E_Msk

/********************  Bits definition for TAMP_CR2 register  *****************/
#define TAMP_CR2_TAMP1POM_Pos               (0UL)
#define TAMP_CR2_TAMP1POM_Msk               (0x1UL << TAMP_CR2_TAMP1POM_Pos)    /*!< 0x00000001 */
#define TAMP_CR2_TAMP1POM                   TAMP_CR2_TAMP1POM_Msk
#define TAMP_CR2_TAMP2POM_Pos               (1UL)
#define TAMP_CR2_TAMP2POM_Msk               (0x1UL << TAMP_CR2_TAMP2POM_Pos)    /*!< 0x00000002 */
#define TAMP_CR2_TAMP2POM                   TAMP_CR2_TAMP2POM_Msk
#define TAMP_CR2_TAMP3POM_Pos               (2UL)
#define TAMP_CR2_TAMP3POM_Msk               (0x1UL << TAMP_CR2_TAMP3POM_Pos)    /*!< 0x00000004 */
#define TAMP_CR2_TAMP3POM                   TAMP_CR2_TAMP3POM_Msk
#define TAMP_CR2_TAMP4POM_Pos               (3UL)
#define TAMP_CR2_TAMP4POM_Msk               (0x1UL << TAMP_CR2_TAMP4POM_Pos)    /*!< 0x00000008 */
#define TAMP_CR2_TAMP4POM                   TAMP_CR2_TAMP4POM_Msk
#define TAMP_CR2_TAMP1MSK_Pos               (16UL)
#define TAMP_CR2_TAMP1MSK_Msk               (0x1UL << TAMP_CR2_TAMP1MSK_Pos)        /*!< 0x00010000 */
#define TAMP_CR2_TAMP1MSK                   TAMP_CR2_TAMP1MSK_Msk
#define TAMP_CR2_TAMP2MSK_Pos               (17UL)
#define TAMP_CR2_TAMP2MSK_Msk               (0x1UL << TAMP_CR2_TAMP2MSK_Pos)        /*!< 0x00020000 */
#define TAMP_CR2_TAMP2MSK                   TAMP_CR2_TAMP2MSK_Msk
#define TAMP_CR2_TAMP3MSK_Pos               (18UL)
#define TAMP_CR2_TAMP3MSK_Msk               (0x1UL << TAMP_CR2_TAMP3MSK_Pos)        /*!< 0x00040000 */
#define TAMP_CR2_TAMP3MSK                   TAMP_CR2_TAMP3MSK_Msk
#define TAMP_CR2_BKBLOCK_Pos                (22UL)
#define TAMP_CR2_BKBLOCK_Msk                (0x1UL << TAMP_CR2_BKBLOCK_Pos)         /*!< 0x00400000 */
#define TAMP_CR2_BKBLOCK                    TAMP_CR2_BKBLOCK_Msk
#define TAMP_CR2_BKERASE_Pos                (23UL)
#define TAMP_CR2_BKERASE_Msk                (0x1UL << TAMP_CR2_BKERASE_Pos)         /*!< 0x00800000 */
#define TAMP_CR2_BKERASE                    TAMP_CR2_BKERASE_Msk
#define TAMP_CR2_TAMP1TRG_Pos               (24UL)
#define TAMP_CR2_TAMP1TRG_Msk               (0x1UL << TAMP_CR2_TAMP1TRG_Pos)        /*!< 0x01000000 */
#define TAMP_CR2_TAMP1TRG                   TAMP_CR2_TAMP1TRG_Msk
#define TAMP_CR2_TAMP2TRG_Pos               (25UL)
#define TAMP_CR2_TAMP2TRG_Msk               (0x1UL << TAMP_CR2_TAMP2TRG_Pos)        /*!< 0x02000000 */
#define TAMP_CR2_TAMP2TRG                   TAMP_CR2_TAMP2TRG_Msk
#define TAMP_CR2_TAMP3TRG_Pos               (26UL)
#define TAMP_CR2_TAMP3TRG_Msk               (0x1UL << TAMP_CR2_TAMP3TRG_Pos)        /*!< 0x02000000 */
#define TAMP_CR2_TAMP3TRG                   TAMP_CR2_TAMP3TRG_Msk
#define TAMP_CR2_TAMP4TRG_Pos               (27UL)
#define TAMP_CR2_TAMP4TRG_Msk               (0x1UL << TAMP_CR2_TAMP4TRG_Pos)        /*!< 0x02000000 */
#define TAMP_CR2_TAMP4TRG                   TAMP_CR2_TAMP4TRG_Msk

/********************  Bits definition for TAMP_CR3 register  *****************/
#define TAMP_CR3_ITAMP3POM_Pos              (2UL)
#define TAMP_CR3_ITAMP3POM_Msk              (0x1UL << TAMP_CR3_ITAMP3POM_Pos)      /*!< 0x00000004 */
#define TAMP_CR3_ITAMP3POM                  TAMP_CR3_ITAMP3POM_Msk
#define TAMP_CR3_ITAMP5POM_Pos              (4UL)
#define TAMP_CR3_ITAMP5POM_Msk              (0x1UL << TAMP_CR3_ITAMP5POM_Pos)      /*!< 0x00000010 */
#define TAMP_CR3_ITAMP5POM                  TAMP_CR3_ITAMP5POM_Msk
#define TAMP_CR3_ITAMP6POM_Pos              (5UL)
#define TAMP_CR3_ITAMP6POM_Msk              (0x1UL << TAMP_CR3_ITAMP6POM_Pos)      /*!< 0x00000020 */
#define TAMP_CR3_ITAMP6POM                  TAMP_CR3_ITAMP6POM_Msk
#define TAMP_CR3_ITAMP7POM_Pos              (6UL)
#define TAMP_CR3_ITAMP7POM_Msk              (0x1UL << TAMP_CR3_ITAMP7POM_Pos)      /*!< 0x00000040 */
#define TAMP_CR3_ITAMP7POM                  TAMP_CR3_ITAMP7POM_Msk
#define TAMP_CR3_ITAMP8POM_Pos              (7UL)
#define TAMP_CR3_ITAMP8POM_Msk              (0x1UL << TAMP_CR3_ITAMP8POM_Pos)      /*!< 0x00000080 */
#define TAMP_CR3_ITAMP8POM                  TAMP_CR3_ITAMP8POM_Msk
#define TAMP_CR3_ITAMP9POM_Pos              (8UL)
#define TAMP_CR3_ITAMP9POM_Msk              (0x1UL << TAMP_CR3_ITAMP9POM_Pos)      /*!< 0x00000100 */
#define TAMP_CR3_ITAMP9POM                  TAMP_CR3_ITAMP9POM_Msk
#define TAMP_CR3_ITAMP11POM_Pos             (10UL)
#define TAMP_CR3_ITAMP11POM_Msk             (0x1UL << TAMP_CR3_ITAMP11POM_Pos)     /*!< 0x00000400 */
#define TAMP_CR3_ITAMP11POM                 TAMP_CR3_ITAMP11POM_Msk
#define TAMP_CR3_ITAMP12POM_Pos             (11UL)
#define TAMP_CR3_ITAMP12POM_Msk             (0x1UL << TAMP_CR3_ITAMP12POM_Pos)     /*!< 0x00000800 */
#define TAMP_CR3_ITAMP12POM                 TAMP_CR3_ITAMP12POM_Msk
#define TAMP_CR3_ITAMP13POM_Pos             (12UL)
#define TAMP_CR3_ITAMP13POM_Msk             (0x1UL << TAMP_CR3_ITAMP13POM_Pos)     /*!< 0x00001000 */
#define TAMP_CR3_ITAMP13POM                 TAMP_CR3_ITAMP13POM_Msk

/********************  Bits definition for TAMP_FLTCR register  ***************/
#define TAMP_FLTCR_TAMPFREQ_Pos             (0UL)
#define TAMP_FLTCR_TAMPFREQ_Msk             (0x7UL << TAMP_FLTCR_TAMPFREQ_Pos)      /*!< 0x00000007 */
#define TAMP_FLTCR_TAMPFREQ                 TAMP_FLTCR_TAMPFREQ_Msk
#define TAMP_FLTCR_TAMPFREQ_0               (0x1UL << TAMP_FLTCR_TAMPFREQ_Pos)      /*!< 0x00000001 */
#define TAMP_FLTCR_TAMPFREQ_1               (0x2UL << TAMP_FLTCR_TAMPFREQ_Pos)      /*!< 0x00000002 */
#define TAMP_FLTCR_TAMPFREQ_2               (0x4UL << TAMP_FLTCR_TAMPFREQ_Pos)      /*!< 0x00000004 */
#define TAMP_FLTCR_TAMPFLT_Pos              (3UL)
#define TAMP_FLTCR_TAMPFLT_Msk              (0x3UL << TAMP_FLTCR_TAMPFLT_Pos)       /*!< 0x00000018 */
#define TAMP_FLTCR_TAMPFLT                  TAMP_FLTCR_TAMPFLT_Msk
#define TAMP_FLTCR_TAMPFLT_0                (0x1UL << TAMP_FLTCR_TAMPFLT_Pos)       /*!< 0x00000008 */
#define TAMP_FLTCR_TAMPFLT_1                (0x2UL << TAMP_FLTCR_TAMPFLT_Pos)       /*!< 0x00000010 */
#define TAMP_FLTCR_TAMPPRCH_Pos             (5UL)
#define TAMP_FLTCR_TAMPPRCH_Msk             (0x3UL << TAMP_FLTCR_TAMPPRCH_Pos)      /*!< 0x00000060 */
#define TAMP_FLTCR_TAMPPRCH                 TAMP_FLTCR_TAMPPRCH_Msk
#define TAMP_FLTCR_TAMPPRCH_0               (0x1UL << TAMP_FLTCR_TAMPPRCH_Pos)      /*!< 0x00000020 */
#define TAMP_FLTCR_TAMPPRCH_1               (0x2UL << TAMP_FLTCR_TAMPPRCH_Pos)      /*!< 0x00000040 */
#define TAMP_FLTCR_TAMPPUDIS_Pos            (7UL)
#define TAMP_FLTCR_TAMPPUDIS_Msk            (0x1UL << TAMP_FLTCR_TAMPPUDIS_Pos)     /*!< 0x00000080 */
#define TAMP_FLTCR_TAMPPUDIS                TAMP_FLTCR_TAMPPUDIS_Msk

